# Latihan 2

### One to many relationship

1. Report the account representative for each customer.
2. Report total payments for Atelier graphique.
3. Report the total payments by date
4. Report the products that have not been sold.
5. List the amount paid by each customer.
6. How many orders have been placed by Herkku Gifts?
7. Who are the employees in Boston?
8. Report those payments greater than $100,000. Sort the report so the customer who made the highest payment appears first.
9. List the value of 'On Hold' orders.
10. Report the number of orders 'On Hold' for each customer.

### Many to many relationship

1. List products sold by order date.
2. List the order dates in descending order for orders for the 1940 Ford Pickup Truck.
3. List the names of customers and their corresponding order number where a particular order from that customer has a value greater than $25,000?
4. Are there any products that appear on all orders?
5. List the names of products sold at less than 80% of the MSRP.
6. Reports those products that have been sold with a markup of 100% or more (i.e., the priceEach is at least twice the buyPrice)
7. List the products ordered on a Monday.
8. What is the quantity on hand for products listed on 'On Hold' orders?

------
## Answer

Preparing MySQL Conection

In [1]:
import mysql.connector
import pandas as pd

user = "root"
passwd = "root"
host = "127.0.0.1"
database = "classicmodels"

conn = mysql.connector.connect(user=user, password=passwd,
                              host=host,
                              database=database)

### One to many relationship

1. Report the account representative for each customer.

In [2]:
account_representative = pd.read_sql_query('SELECT customerName, CONCAT(firstName, " ",lastName) AS Name FROM customers INNER JOIN employees ON customers.salesRepEmployeeNumber = employees.employeeNumber', conn)
print (account_representative)

                          customerName             Name
0         Mini Gifts Distributors Ltd.  Leslie Jennings
1                      Mini Wheels Co.  Leslie Jennings
2                 Technics Stores Inc.  Leslie Jennings
3             Corporate Gift Ideas Co.  Leslie Jennings
4            The Sharp Gifts Warehouse  Leslie Jennings
5             Signal Collectibles Ltd.  Leslie Jennings
6                   Signal Gift Stores  Leslie Thompson
7                    Toys4GrownUps.com  Leslie Thompson
8                    Boards & Toys Co.  Leslie Thompson
9         Collectable Mini Designs Co.  Leslie Thompson
10          Men 'R' US Retailers, Ltd.  Leslie Thompson
11         West Coast Collectables Co.  Leslie Thompson
12          Cambridge Collectables Co.   Julie Firrelli
13            Online Mini Collectables   Julie Firrelli
14                 Mini Creations Ltd.   Julie Firrelli
15             Classic Gift Ideas, Inc   Julie Firrelli
16          Collectables For Less Inc.   Julie Firrelli
17                Diecast Collectables   Julie Firrelli
18               Diecast Classics Inc.  Steve Patterson
19             Auto-Moto Classics Inc.  Steve Patterson
20                Marta's Replicas Co.  Steve Patterson
21                   Gifts4AllAges.com  Steve Patterson
22        Online Diecast Creations Co.  Steve Patterson
23                    FunGiftIdeas.com  Steve Patterson
24                  Muscle Machine Inc   Foon Yue Tseng
25              American Souvenirs Inc   Foon Yue Tseng
26                     Vitachrome Inc.   Foon Yue Tseng
27        Québec Home Shopping Network   Foon Yue Tseng
28                Classic Legends Inc.   Foon Yue Tseng
29                    Super Scale Inc.   Foon Yue Tseng
..                                 ...              ...
70                  Baane Mini Imports      Barry Jones
71                Blauer See Auto, Co.      Barry Jones
72            Volvo Model Replicas, Co      Barry Jones
73                        Herkku Gifts      Barry Jones
74             Clover Collections, Co.      Barry Jones
75             Toms Spezialitäten, Ltd      Barry Jones
76           Norway Gifts By Mail, Co.      Barry Jones
77  Bavarian Collectables Imports, Co.      Barry Jones
78             Scandinavian Gift Ideas      Barry Jones
79          Australian Collectors, Co.      Andy Fixter
80             Anna's Decorations, Ltd      Andy Fixter
81           Souveniers And Things Co.      Andy Fixter
82         Australian Gift Network, Co      Andy Fixter
83        Australian Collectables, Ltd      Andy Fixter
84                    Handji Gifts& Co      Peter Marsh
85          Down Under Souveniers, Inc      Peter Marsh
86                     GiftsForHim.com      Peter Marsh
87       Extreme Desk Decorations, Ltd      Peter Marsh
88                   Kelly's Gift Shop      Peter Marsh
89             Dragon Souveniers, Ltd.       Mami Nishi
90                Osaka Souveniers Co.       Mami Nishi
91         King Kong Collectables, Co.       Mami Nishi
92                     Cruz & Sons Co.       Mami Nishi
93             Tokyo Collectables, Ltd       Mami Nishi
94                  Enaco Distributors    Martin Gerard
95                     Vida Sport, Ltd    Martin Gerard
96                         CAF Imports    Martin Gerard
97               Precious Collectables    Martin Gerard
98          Corrida Auto Replicas, Ltd    Martin Gerard
99          Iberia Gift Imports, Corp.    Martin Gerard

[100 rows x 2 columns]

2. Report total payments for Atelier graphique.

In [3]:
atelier_total_payment = pd.read_sql_query('SELECT customerName, SUM(amount) AS Total_payment FROM customers AS t1 INNER JOIN payments AS t2 ON t1.customerNumber =  t2.customerNumber WHERE customerName = "Atelier graphique"', conn)
print (atelier_total_payment)

        customerName  Total_payment
0  Atelier graphique       22314.36

3. Report the total payments by date

In [4]:
total_payment_by_date = pd.read_sql_query("SELECT paymentDate, SUM(amount) AS Total_Payment FROM payments GROUP BY paymentDate", conn)
print (total_payment_by_date)

    paymentDate  Total_Payment
0    2003-01-16       10223.83
1    2003-01-28       10549.01
2    2003-01-30        5494.78
3    2003-02-16       50218.95
4    2003-02-20       53959.21
5    2003-02-25       40206.20
6    2003-03-02       52151.81
7    2003-03-09       51001.22
8    2003-03-12       22292.62
9    2003-03-20       25833.14
10   2003-03-27       48425.69
11   2003-04-09       24212.79
12   2003-04-11       11044.30
13   2003-04-16       21665.98
14   2003-04-19        1627.56
15   2003-04-20       33383.14
16   2003-04-22       44380.15
17   2003-05-09        3101.40
18   2003-05-12       35826.33
19   2003-05-20       45864.03
20   2003-05-21       16700.47
21   2003-05-25       50824.66
22   2003-05-31        7565.08
23   2003-06-05       14571.44
24   2003-06-06       32641.98
25   2003-06-13       57131.92
26   2003-06-18       58841.35
27   2003-06-25       17032.29
28   2003-07-05        2880.00
29   2003-07-06        6036.96
..          ...            ...
202  2005-02-02       12692.19
203  2005-02-03       14379.90
204  2005-02-06       39580.60
205  2005-02-09       27083.78
206  2005-02-12       28322.83
207  2005-02-14       33967.73
208  2005-02-15       46770.52
209  2005-02-22       49523.67
210  2005-03-01       21432.31
211  2005-03-02        3452.75
212  2005-03-05      101244.59
213  2005-03-10       23602.90
214  2005-03-15       46781.66
215  2005-03-18      120166.58
216  2005-03-25       65071.26
217  2005-03-27        3516.04
218  2005-04-15       30293.77
219  2005-04-16       83598.04
220  2005-04-18       27966.54
221  2005-04-23       12190.85
222  2005-04-30       29848.52
223  2005-05-03       43964.87
224  2005-05-17       17928.09
225  2005-05-18         615.45
226  2005-05-19       75396.26
227  2005-05-20       29070.38
228  2005-05-23       75020.13
229  2005-05-25       30253.75
230  2005-06-03       12432.32
231  2005-06-09       46656.94

[232 rows x 2 columns]

4. Report the products that have not been sold.

In [5]:
not_been_sold = pd.read_sql_query("SELECT DISTINCT(productName) FROM products WHERE productCode NOT IN ( SELECT productCode FROM orderdetails )", conn)
print (not_been_sold)

         productName
0  1985 Toyota Supra

5. List the amount paid by each customer.

In [6]:
paid_by_custumer = pd.read_sql_query("SELECT customerName, SUM(amount) FROM customers INNER JOIN payments ON customers.customerNumber = payments.customerNumber GROUP BY customerName", conn)
print (paid_by_custumer)

                          customerName  SUM(amount)
0                         Alpha Cognac     60483.36
1                   Amica Models & Co.     82223.23
2              Anna's Decorations, Ltd    137034.22
3                    Atelier graphique     22314.36
4         Australian Collectables, Ltd     44920.76
5           Australian Collectors, Co.    180585.07
6          Australian Gift Network, Co     55190.16
7                 Auto Associés & Cie.     58876.41
8                    Auto Canal+ Petit     86436.97
9              Auto-Moto Classics Inc.     21554.26
10                      AV Stores, Co.    148410.09
11                  Baane Mini Imports    104224.79
12  Bavarian Collectables Imports, Co.     31310.09
13                Blauer See Auto, Co.     75937.76
14                   Boards & Toys Co.      7918.60
15                         CAF Imports     46751.14
16          Cambridge Collectables Co.     32198.69
17      Canadian Gift Exchange Network     70122.19
18             Classic Gift Ideas, Inc     57939.34
19                Classic Legends Inc.     69214.33
20             Clover Collections, Co.     49898.27
21        Collectable Mini Designs Co.     80375.24
22          Collectables For Less Inc.     73533.65
23            Corporate Gift Ideas Co.    132340.78
24          Corrida Auto Replicas, Ltd    112440.09
25                     Cruz & Sons Co.     87468.30
26            Daedalus Designs Imports     61781.70
27            Danish Wholesale Imports    107446.50
28               Diecast Classics Inc.     98509.25
29                Diecast Collectables     65541.74
..                                 ...          ...
68            Online Mini Collectables     55577.26
69                Osaka Souveniers Co.     62361.22
70             Oulu Toy Supplies, Inc.     95706.15
71                          Petit Auto     62253.85
72        Québec Home Shopping Network     68977.67
73                  Reims Collectables    126983.19
74                       Rovelli Gifts    127529.69
75   Royal Canadian Collectables, Ltd.     66812.00
76                        Royale Belge     29217.18
77               Salzburg Collectables     85060.00
78              Saveley & Henriot, Co.    130305.35
79             Scandinavian Gift Ideas     76776.44
80            Signal Collectibles Ltd.     42570.37
81                  Signal Gift Stores     80180.98
82           Souveniers And Things Co.     91655.61
83            Stylish Desk Decors, Co.     80556.73
84                 Suominen Souveniers    103896.74
85                    Super Scale Inc.     70378.65
86                Technics Stores Inc.    104545.22
87             Tekni Collectables Inc.     38281.51
88           The Sharp Gifts Warehouse     59551.38
89             Tokyo Collectables, Ltd    105548.73
90             Toms Spezialitäten, Ltd     89223.14
91                Toys of Finland, Co.     95546.46
92                   Toys4GrownUps.com     93803.30
93               UK Collectables, Ltd.     61167.18
94                     Vida Sport, Ltd    108777.92
95                     Vitachrome Inc.     72497.64
96            Volvo Model Replicas, Co     43680.65
97         West Coast Collectables Co.     43748.72

[98 rows x 2 columns]

6. How many orders have been placed by Herkku Gifts?

In [7]:
herkku_order = pd.read_sql_query("SELECT customerName, COUNT(orderNumber) AS Placed FROM customers INNER JOIN orders ON customers.customerNumber = orders.customerNumber WHERE customerName = 'Herkku Gifts' GROUP BY customerName", conn)
print (herkku_order)

   customerName  Placed
0  Herkku Gifts       3

7. Who are the employees in Boston?

In [8]:
boston_employee = pd.read_sql_query("SELECT CONCAT(firstName, lastName), city FROM employees INNER JOIN offices ON employees.officeCode = offices.officeCode WHERE city = 'Boston'", conn)
print (boston_employee)

  CONCAT(firstName, lastName)    city
0               JulieFirrelli  Boston
1              StevePatterson  Boston

8. Report those payments greater than $100,000. Sort the report so the customer who made the highest payment appears first.

In [9]:
customer_payment_100 = pd.read_sql_query("SELECT customerName, SUM(amount) AS Total FROM customers INNER JOIN payments ON customers.customerNumber = payments.customerNumber GROUP BY customerName HAVING Total > 100000", conn)
print (customer_payment_100)

                    customerName      Total
0        Anna's Decorations, Ltd  137034.22
1     Australian Collectors, Co.  180585.07
2                 AV Stores, Co.  148410.09
3             Baane Mini Imports  104224.79
4       Corporate Gift Ideas Co.  132340.78
5     Corrida Auto Replicas, Ltd  112440.09
6       Danish Wholesale Imports  107446.50
7     Down Under Souveniers, Inc  154622.08
8        Dragon Souveniers, Ltd.  156251.03
9         Euro+ Shopping Channel  715738.98
10              Handji Gifts& Co  105420.57
11             Kelly's Gift Shop  114497.19
12             La Rochelle Gifts  116949.68
13             Land of Toys Inc.  107639.94
14           Mini Creations Ltd.  101872.52
15  Mini Gifts Distributors Ltd.  584188.24
16            Muscle Machine Inc  177913.95
17  Online Diecast Creations Co.  116449.29
18            Reims Collectables  126983.19
19                 Rovelli Gifts  127529.69
20        Saveley & Henriot, Co.  130305.35
21           Suominen Souveniers  103896.74
22          Technics Stores Inc.  104545.22
23       Tokyo Collectables, Ltd  105548.73
24               Vida Sport, Ltd  108777.92

9. List the value of 'On Hold' orders.

In [10]:
on_hold_order = pd.read_sql_query("SELECT customerName, status FROM orders INNER JOIN customers ON orders.customerNumber = customers.customerNumber WHERE status = 'On Hold'", conn)
print (on_hold_order)

                customerName   status
0   Volvo Model Replicas, Co  On Hold
1    Tekni Collectables Inc.  On Hold
2  The Sharp Gifts Warehouse  On Hold
3          Gifts4AllAges.com  On Hold

10. Report the number of orders 'On Hold' for each customer.

In [11]:
number_on_hold_customer = pd.read_sql_query("SELECT customerName, COUNT(status) AS Jumlah_ON_HOLD FROM orders INNER JOIN customers ON orders.customerNumber = customers.customerNumber WHERE status = 'On Hold' GROUP BY customerName", conn)
print (number_on_hold_customer)

                customerName  Jumlah_ON_HOLD
0          Gifts4AllAges.com               1
1    Tekni Collectables Inc.               1
2  The Sharp Gifts Warehouse               1
3   Volvo Model Replicas, Co               1

### Many to many relationship

1. List products sold by order date.

In [12]:
sold = pd.read_sql_query("SELECT productName, orderDate FROM products INNER JOIN orderdetails ON products.productCode = orderdetails.productCode INNER JOIN orders ON orderdetails.orderNumber = orders.orderNumber ORDER BY orderDate", conn)
print (sold)

                                      productName   orderDate
0                        1917 Grand Touring Sedan  2003-01-06
1             1932 Alfa Romeo 8C2300 Spider Sport  2003-01-06
2                              1911 Ford Town Car  2003-01-06
3                1936 Mercedes Benz 500k Roadster  2003-01-06
4                          1928 Mercedes-Benz SSK  2003-01-09
5                       1932 Model A Ford J-Coupe  2003-01-09
6       1938 Cadillac V-16 Presidential Limousine  2003-01-09
7                     1939 Chevrolet Deluxe Coupe  2003-01-09
8                            1937 Lincoln Berline  2003-01-10
9        1936 Mercedes-Benz 500K Special Roadster  2003-01-10
10            18th Century Vintage Horse Carriage  2003-01-29
11                    1980’s GM Manhattan Express  2003-01-29
12                                1982 Camaro Z28  2003-01-29
13                          1936 Chrysler Airflow  2003-01-29
14    1996 Peterbilt 379 Stake Bed with Outrigger  2003-01-29
15                       1962 Volkswagen Microbus  2003-01-29
16                        1939 Cadillac Limousine  2003-01-29
17                             1934 Ford V8 Coupe  2003-01-29
18                                 1958 Setra Bus  2003-01-29
19                               1940s Ford truck  2003-01-29
20                       1917 Maxwell Touring Car  2003-01-29
21                    1913 Ford Model T Speedster  2003-01-29
22                       1952 Alpine Renault 1300  2003-01-29
23                         1962 LanciaA Delta 16V  2003-01-29
24                         1940 Ford Pickup Truck  2003-01-29
25                          1926 Ford Fire Engine  2003-01-29
26                             1969 Corvair Monza  2003-01-31
27                    1954 Greyhound Scenicruiser  2003-01-31
28                    1992 Ferrari 360 Spider red  2003-01-31
29            1958 Chevy Corvette Limited Edition  2003-01-31
...                                           ...         ...
2966          1932 Alfa Romeo 8C2300 Spider Sport  2005-05-29
2967    1938 Cadillac V-16 Presidential Limousine  2005-05-29
2968                           1949 Jaguar XK 120  2005-05-29
2969                            1952 Citroen-15CV  2005-05-29
2970                     1917 Maxwell Touring Car  2005-05-30
2971                  1913 Ford Model T Speedster  2005-05-30
2972     1936 Mercedes-Benz 500K Special Roadster  2005-05-30
2973          18th Century Vintage Horse Carriage  2005-05-30
2974                        1936 Chrysler Airflow  2005-05-30
2975                         1937 Lincoln Berline  2005-05-30
2976                           1934 Ford V8 Coupe  2005-05-30
2977                            1957 Chevy Pickup  2005-05-31
2978                           1970 Dodge Coronet  2005-05-31
2979                     1952 Alpine Renault 1300  2005-05-31
2980                       1962 LanciaA Delta 16V  2005-05-31
2981             Diamond T620 Semi-Skirted Tanker  2005-05-31
2982               1998 Chrysler Plymouth Prowler  2005-05-31
2983                        1926 Ford Fire Engine  2005-05-31
2984                       1940 Ford Pickup Truck  2005-05-31
2985                  1992 Ferrari 360 Spider red  2005-05-31
2986                  1954 Greyhound Scenicruiser  2005-05-31
2987                  1980’s GM Manhattan Express  2005-05-31
2988                              1982 Camaro Z28  2005-05-31
2989  1996 Peterbilt 379 Stake Bed with Outrigger  2005-05-31
2990                     1962 Volkswagen Microbus  2005-05-31
2991          1958 Chevy Corvette Limited Edition  2005-05-31
2992                      1939 Cadillac Limousine  2005-05-31
2993                       1964 Mercedes Tour Bus  2005-05-31
2994                               1958 Setra Bus  2005-05-31
2995                             1940s Ford truck  2005-05-31

[2996 rows x 2 columns]

2. List the order dates in descending order for orders for the 1940 Ford Pickup Truck.

In [13]:
desc_date_ford_pickup = pd.read_sql_query("SELECT orderDate, productName FROM orders INNER JOIN orderdetails ON orders.orderNumber = orderdetails.orderNumber INNER JOIN products ON orderdetails.productCode = products.productCode WHERE productName = '1940 Ford Pickup Truck' ORDER BY orderDate DESC", conn)
print (desc_date_ford_pickup)

     orderDate             productName
0   2005-05-31  1940 Ford Pickup Truck
1   2005-05-01  1940 Ford Pickup Truck
2   2005-03-09  1940 Ford Pickup Truck
3   2005-02-17  1940 Ford Pickup Truck
4   2005-01-20  1940 Ford Pickup Truck
5   2004-12-10  1940 Ford Pickup Truck
6   2004-11-29  1940 Ford Pickup Truck
7   2004-11-18  1940 Ford Pickup Truck
8   2004-11-04  1940 Ford Pickup Truck
9   2004-10-21  1940 Ford Pickup Truck
10  2004-10-11  1940 Ford Pickup Truck
11  2004-09-08  1940 Ford Pickup Truck
12  2004-08-17  1940 Ford Pickup Truck
13  2004-07-19  1940 Ford Pickup Truck
14  2004-06-15  1940 Ford Pickup Truck
15  2004-05-04  1940 Ford Pickup Truck
16  2004-03-10  1940 Ford Pickup Truck
17  2004-01-29  1940 Ford Pickup Truck
18  2003-12-05  1940 Ford Pickup Truck
19  2003-11-25  1940 Ford Pickup Truck
20  2003-11-13  1940 Ford Pickup Truck
21  2003-11-06  1940 Ford Pickup Truck
22  2003-10-21  1940 Ford Pickup Truck
23  2003-09-19  1940 Ford Pickup Truck
24  2003-07-24  1940 Ford Pickup Truck
25  2003-05-28  1940 Ford Pickup Truck
26  2003-03-26  1940 Ford Pickup Truck
27  2003-01-29  1940 Ford Pickup Truck

3. List the names of customers and their corresponding order number where a particular order from that customer has a value greater than $25,000?

In [14]:
customer_order_value_25 = pd.read_sql_query("SELECT customerName, orders.orderNumber, SUM(priceEach * quantityOrdered) AS Val FROM customers INNER JOIN orders ON customers.customerNumber = orders.customerNumber INNER JOIN orderdetails ON orders.orderNumber = orderdetails.orderNumber GROUP BY orderNumber HAVING Val > 25000", conn)
print (customer_order_value_25)

                     customerName  orderNumber       Val
0              Baane Mini Imports        10103  50218.95
1          Euro+ Shopping Channel        10104  40206.20
2        Danish Wholesale Imports        10105  53959.21
3                   Rovelli Gifts        10106  52151.81
4                 Cruz & Sons Co.        10108  51001.22
5    Motor Mint Distributors Inc.        10109  25833.14
6                  AV Stores, Co.        10110  48425.69
7       La Corne D'abondance, Co.        10114  33383.14
8         Dragon Souveniers, Ltd.        10117  44380.15
9           Salzburg Collectables        10119  35826.33
10     Australian Collectors, Co.        10120  45864.03
11           Marseille Mini Autos        10122  50824.66
12             Signal Gift Stores        10124  32641.98
13     Corrida Auto Replicas, Ltd        10126  57131.92
14             Muscle Machine Inc        10127  58841.35
15       Stylish Desk Decors, Co.        10129  29429.14
16   Mini Gifts Distributors Ltd.        10135  55601.84
17              Kelly's Gift Shop        10138  32077.44
18           Technics Stores Inc.        10140  38675.13
19            Suominen Souveniers        10141  29716.86
20   Mini Gifts Distributors Ltd.        10142  56052.56
21            Mini Creations Ltd.        10143  41016.75
22              Toys4GrownUps.com        10145  50342.74
23     Collectables For Less Inc.        10147  32680.31
24        Anna's Decorations, Ltd        10148  41554.73
25       Signal Collectibles Ltd.        10149  29997.09
26        Dragon Souveniers, Ltd.        10150  38350.15
27        Oulu Toy Supplies, Inc.        10151  32723.04
28         Euro+ Shopping Channel        10153  44939.85
29           Toys of Finland, Co.        10155  37602.48
..                            ...          ...       ...
162        Euro+ Shopping Channel        10380  34404.21
163      Corporate Gift Ideas Co.        10381  32626.09
164  Mini Gifts Distributors Ltd.        10382  47765.59
165        Euro+ Shopping Channel        10383  36851.98
166        Euro+ Shopping Channel        10386  46968.52
167              FunGiftIdeas.com        10388  30293.77
168       Scandinavian Gift Ideas        10389  27966.54
169  Mini Gifts Distributors Ltd.        10390  55902.50
170       Anna's Decorations, Ltd        10391  29848.52
171    Down Under Souveniers, Inc        10393  33593.32
172  Mini Gifts Distributors Ltd.        10396  27695.54
173            Reims Collectables        10398  46656.94
174             Kelly's Gift Shop        10399  30253.75
175     The Sharp Gifts Warehouse        10400  31755.34
176       Tekni Collectables Inc.        10401  43525.04
177         UK Collectables, Ltd.        10403  37258.94
178    Down Under Souveniers, Inc        10404  41426.81
179                   Mini Caravy        10405  35157.75
180     The Sharp Gifts Warehouse        10407  52229.55
181               GiftsForHim.com        10410  36442.34
182  Québec Home Shopping Network        10411  29070.38
183        Euro+ Shopping Channel        10412  46895.48
184               Gift Depot Inc.        10413  28500.78
185             Gifts4AllAges.com        10414  50806.85
186           L'ordine Souveniers        10416  35362.26
187        Euro+ Shopping Channel        10417  28574.90
188         Salzburg Collectables        10419  52420.07
189     Souveniers And Things Co.        10420  42251.51
190        Euro+ Shopping Channel        10424  29310.30
191             La Rochelle Gifts        10425  41623.44

[192 rows x 3 columns]

4. Are there any products that appear on all orders?

In [15]:
# There are none
all_time_product = pd.read_sql("SELECT productName FROM products INNER JOIN orderdetails ON products.productCode = orderdetails.productCode GROUP BY productName HAVING COUNT(DISTINCT(orderNumber)) > ( SELECT COUNT(DISTINCT(orderNumber)) FROM orderdetails)", conn)
print (all_time_product)

Empty DataFrame
Columns: [productName]
Index: []

5. List the names of products sold at less than 80% of the MSRP.

In [16]:
msrp_80 = pd.read_sql_query("SELECT productName FROM products INNER JOIN orderdetails ON products.productCode = orderdetails.productCode WHERE priceEach / MSRP < 0.8", conn)
print (msrp_80)

                                    productName
0                         1996 Moto Guzzi 1100i
1                               1993 Mazda RX-7
2                          1937 Lincoln Berline
3                         1965 Aston Martin DB5
4                         1965 Aston Martin DB5
5                   1980s Black Hawk Helicopter
6                   1980s Black Hawk Helicopter
7                            1911 Ford Town Car
8                                P-51-D Mustang
9                                P-51-D Mustang
10                  1992 Ferrari 360 Spider red
11                  1992 Ferrari 360 Spider red
12                  1992 Ferrari 360 Spider red
13                  1992 Ferrari 360 Spider red
14                     Collectable Wooden Train
15                        1976 Ford Gran Torino
16          1932 Alfa Romeo 8C2300 Spider Sport
17                             1940s Ford truck
18                             1940s Ford truck
19                             1940s Ford truck
20                  1939 Chevrolet Deluxe Coupe
21                  1939 Chevrolet Deluxe Coupe
22                        18th century schooner
23                     1962 Volkswagen Microbus
24                     1962 Volkswagen Microbus
25                            1952 Citroen-15CV
26                            1952 Citroen-15CV
27                    1971 Alpine Renault 1600s
28                      1956 Porsche 356A Coupe
29                      1956 Porsche 356A Coupe
30                      1956 Porsche 356A Coupe
31                     Corsair F4U ( Bird Cage)
32             1936 Mercedes Benz 500k Roadster
33             1936 Mercedes Benz 500k Roadster
34             1936 Mercedes Benz 500k Roadster
35                             1997 BMW F650 ST
36       1950's Chicago Surface Lines Streetcar
37  1996 Peterbilt 379 Stake Bed with Outrigger
38                 1930 Buick Marquette Phaeton
39               1962 City of Detroit Streetcar
40                  American Airlines: B767-300
41                  American Airlines: B767-300
42                    The USS Constitution Ship
43                    American Airlines: MD-11S

6. Reports those products that have been sold with a markup of 100% or more (i.e., the priceEach is at least twice the buyPrice)

In [17]:
sold_2x = pd.read_sql_query("SELECT productName FROM products INNER JOIN orderdetails ON products.productCode = orderdetails.productCode WHERE priceEach >= buyPrice * 2", conn)
print (sold_2x)

                              productName
0                1952 Alpine Renault 1300
1                1952 Alpine Renault 1300
2                1952 Alpine Renault 1300
3                1952 Alpine Renault 1300
4                1952 Alpine Renault 1300
5                1952 Alpine Renault 1300
6                1952 Alpine Renault 1300
7                1952 Alpine Renault 1300
8                1952 Alpine Renault 1300
9                1952 Alpine Renault 1300
10               1952 Alpine Renault 1300
11               1952 Alpine Renault 1300
12               1952 Alpine Renault 1300
13               1952 Alpine Renault 1300
14               1952 Alpine Renault 1300
15               1952 Alpine Renault 1300
16   2003 Harley-Davidson Eagle Drag Bike
17   2003 Harley-Davidson Eagle Drag Bike
18   2003 Harley-Davidson Eagle Drag Bike
19   2003 Harley-Davidson Eagle Drag Bike
20   2003 Harley-Davidson Eagle Drag Bike
21   2003 Harley-Davidson Eagle Drag Bike
22   2003 Harley-Davidson Eagle Drag Bike
23   2003 Harley-Davidson Eagle Drag Bike
24   2003 Harley-Davidson Eagle Drag Bike
25                      1968 Ford Mustang
26                      1968 Ford Mustang
27                      2001 Ferrari Enzo
28                      2001 Ferrari Enzo
29                      2001 Ferrari Enzo
..                                    ...
470                            HMS Bounty
471                            HMS Bounty
472                            HMS Bounty
473                            HMS Bounty
474                            HMS Bounty
475                            HMS Bounty
476                            HMS Bounty
477                            HMS Bounty
478                            HMS Bounty
479             The USS Constitution Ship
480             The USS Constitution Ship
481             The USS Constitution Ship
482             The USS Constitution Ship
483             The USS Constitution Ship
484             The USS Constitution Ship
485             The USS Constitution Ship
486             The USS Constitution Ship
487             The USS Constitution Ship
488             The USS Constitution Ship
489                       1982 Camaro Z28
490                       1982 Camaro Z28
491                       1982 Camaro Z28
492                       1982 Camaro Z28
493                       1982 Camaro Z28
494                       1982 Camaro Z28
495                       1982 Camaro Z28
496                       1982 Camaro Z28
497                       1982 Camaro Z28
498             American Airlines: MD-11S
499             American Airlines: MD-11S

[500 rows x 1 columns]

7. List the products ordered on a Monday.

In [18]:
monday_order = pd.read_sql_query("SELECT productName, DATE_FORMAT(orderDate, '%W') AS Day FROM products INNER JOIN orderdetails ON products.productCode = orderdetails.productCode INNER JOIN orders ON orderdetails.orderNumber = orders.orderNumber HAVING Day = 'Monday'", conn)
print (monday_order)

                               productName     Day
0    1969 Harley Davidson Ultimate Chopper  Monday
1    1969 Harley Davidson Ultimate Chopper  Monday
2    1969 Harley Davidson Ultimate Chopper  Monday
3    1969 Harley Davidson Ultimate Chopper  Monday
4    1969 Harley Davidson Ultimate Chopper  Monday
5    1969 Harley Davidson Ultimate Chopper  Monday
6                 1952 Alpine Renault 1300  Monday
7                 1952 Alpine Renault 1300  Monday
8                 1952 Alpine Renault 1300  Monday
9                 1952 Alpine Renault 1300  Monday
10                1952 Alpine Renault 1300  Monday
11                   1996 Moto Guzzi 1100i  Monday
12                   1996 Moto Guzzi 1100i  Monday
13                   1996 Moto Guzzi 1100i  Monday
14                   1996 Moto Guzzi 1100i  Monday
15                   1996 Moto Guzzi 1100i  Monday
16                   1996 Moto Guzzi 1100i  Monday
17                   1996 Moto Guzzi 1100i  Monday
18    2003 Harley-Davidson Eagle Drag Bike  Monday
19    2003 Harley-Davidson Eagle Drag Bike  Monday
20    2003 Harley-Davidson Eagle Drag Bike  Monday
21    2003 Harley-Davidson Eagle Drag Bike  Monday
22    2003 Harley-Davidson Eagle Drag Bike  Monday
23    2003 Harley-Davidson Eagle Drag Bike  Monday
24    2003 Harley-Davidson Eagle Drag Bike  Monday
25                     1972 Alfa Romeo GTA  Monday
26                     1972 Alfa Romeo GTA  Monday
27                     1972 Alfa Romeo GTA  Monday
28                     1972 Alfa Romeo GTA  Monday
29                  1962 LanciaA Delta 16V  Monday
..                                     ...     ...
377                          ATA: B757-300  Monday
378                          ATA: B757-300  Monday
379                          ATA: B757-300  Monday
380                     F/A 18 Hornet 1/72  Monday
381                     F/A 18 Hornet 1/72  Monday
382                     F/A 18 Hornet 1/72  Monday
383                     F/A 18 Hornet 1/72  Monday
384                     F/A 18 Hornet 1/72  Monday
385                            The Titanic  Monday
386                            The Titanic  Monday
387                            The Titanic  Monday
388                         The Queen Mary  Monday
389                         The Queen Mary  Monday
390              American Airlines: MD-11S  Monday
391              American Airlines: MD-11S  Monday
392              American Airlines: MD-11S  Monday
393              American Airlines: MD-11S  Monday
394              American Airlines: MD-11S  Monday
395              American Airlines: MD-11S  Monday
396              American Airlines: MD-11S  Monday
397                       Boeing X-32A JSF  Monday
398                       Boeing X-32A JSF  Monday
399                       Boeing X-32A JSF  Monday
400                       Boeing X-32A JSF  Monday
401                       Boeing X-32A JSF  Monday
402                       Boeing X-32A JSF  Monday
403                       Boeing X-32A JSF  Monday
404                       Boeing X-32A JSF  Monday
405                             Pont Yacht  Monday
406                             Pont Yacht  Monday

[407 rows x 2 columns]

8. What is the quantity on hand for products listed on 'On Hold' orders?

In [19]:
on_hold_quantity = pd.read_sql_query("SELECT quantityInStock FROM products INNER JOIN orderdetails ON products.productCode = orderdetails.productCode INNER JOIN orders ON orderdetails.orderNumber = orders.orderNumber WHERE status = 'On Hold'", conn)
print (on_hold_quantity)

    quantityInStock
0              6791
1              8258
2              2018
3              8347
4              3128
5              2327
6               992
7              3627
8              6812
9              2756
10              178
11              136
12             7062
13             5841
14             9653
15             7106
16              551
17             8820
18             9042
19             2724
20              540
21             8164
22             6553
23             3209
24             1005
25             8197
26             2350
27             1452
28             4695
29             9446
30             3252
31             4259
32             3913
33             6450
34             8290
35             1898
36             9173
37             6621
38             1897
39              737
40             7083
41             1956
42             5088
43              414